system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
	// (0 0 0) is origin
    (-0.2 0.2  0)    // 0
    ( 0.2 0.2  0)    // 1
    ( 0.2 -0.2 0)    // 2
    (-0.2 -0.2 0)    // 3

	// sqrt(0.5) = 0.707106781186547 
    (-0.707106781186547	0.707106781186547  0) // 4
    ( 0.707106781186547	0.707106781186547  0) // 5
    ( 0.707106781186547	-0.707106781186547 0) // 6
    (-0.707106781186547	-0.707106781186547 0) // 7

    (-0.2 0.2  -2)    // 8
    ( 0.2 0.2  -2)    // 9
    ( 0.2 -0.2 -2)    // 10
    (-0.2 -0.2 -2)    // 11

    (-0.707106781186547	0.707106781186547  -2) // 12
    ( 0.707106781186547	0.707106781186547  -2) // 13
    ( 0.707106781186547	-0.707106781186547 -2) // 14
    (-0.707106781186547	-0.707106781186547 -2) // 15

    (-0.2 0.2  -4)    // 16
    ( 0.2 0.2  -4)    // 17
    ( 0.2 -0.2 -4)    // 18
    (-0.2 -0.2 -4)    // 19

    (-0.707106781186547	0.707106781186547  -4) // 20
    ( 0.707106781186547	0.707106781186547  -4) // 21
    ( 0.707106781186547	-0.707106781186547 -4) // 22
    (-0.707106781186547	-0.707106781186547 -4) // 23

    (-0.2 0.2  -8)    // 24
    ( 0.2 0.2  -8)    // 25
    ( 0.2 -0.2 -8)    // 26
    (-0.2 -0.2 -8)    // 27

    (-0.707106781186547	0.707106781186547  -8) // 28
    ( 0.707106781186547	0.707106781186547  -8) // 29
    ( 0.707106781186547	-0.707106781186547 -8) // 30
    (-0.707106781186547	-0.707106781186547 -8) // 31
);

blocks
(
    hex (0 1 2 3 8 9 10 11) (20 20 20) simpleGrading (1 1 1) // 0
    hex (0 4 5 1 8 12 13 9) (20 20 20) simpleGrading (1 1 1) // 1
    hex (1 5 6 2 9 13 14 10) (20 20 20) simpleGrading (1 1 1) // 2
    hex (2 6 7 3 10 14 15 11) (20 20 20) simpleGrading (1 1 1) // 3
    hex (3 7 4 0 11 15 12 8) (20 20 20) simpleGrading (1 1 1) // 4

    hex (8 9 10 11 16 17 18 19) (20 20 20) simpleGrading (1 1 1) // 5
    hex (8 12 13 9 16 20 21 17) (20 20 20) simpleGrading (1 1 1) // 6
    hex (9 13 14 10 17 21 22 18) (20 20 20) simpleGrading (1 1 1) // 7 
    hex (10 14 15 11 18 22 23 19) (20 20 20) simpleGrading (1 1 1) // 8
    hex (11 15 12 8 19 23 20 16) (20 20 20) simpleGrading (1 1 1) // 9

    hex (16 17 18 19 24 25 26 27) (20 20 20) simpleGrading (1 1 1) // 10
    hex (16 20 21 17 24 28 29 25) (20 20 20) simpleGrading (1 1 1) // 11
    hex (17 21 22 18 25 29 30 26) (20 20 20) simpleGrading (1 1 1) // 12
    hex (18 22 23 19 26 30 31 27) (20 20 20) simpleGrading (1 1 1) // 13
    hex (19 23 20 16 27 31 28 24) (20 20 20) simpleGrading (1 1 1) // 14
);

edges
(
	arc 4 5 (0 1 0)    // block 1
	arc 12 13 (0 1 -2) // block 1
	arc 20 21 (0 1 -4) // block 6
	arc 28 29 (0 1 -8) // block 11

	arc 5 6 (1 0 0)    // block 2
	arc 13 14 (1 0 -2)    // block 2
	arc 21 22 (1 0 -4)    // block 7
	arc 29 30 (1 0 -8)    // block 12

	arc 6 7 (0 -1 0)    // block 3
	arc 14 15 (0 -1 -2)    // block 3
	arc 22 23 (0 -1 -4)    // block 8
	arc 30 31 (0 -1 -8)    // block 13

	arc 7 4 (-1 0 0)    // block 4
	arc 15 12 (-1 0 -2)    // block 4
	arc 23 20 (-1 0 -4)    // block 9
	arc 31 28 (-1 0 -8)    // block 14

);

boundary
(
    INLET
    {
        type patch;
        faces
        (
            (0 4 5 1)
            (5 6 2 1)
            (2 6 7 3)
            (3 7 4 0)
            (0 1 2 3)
        );
    }
    OUTLET
    {
        type patch;
        faces
        (
            (24 28 29 25)
            (25 29 30 26)
            (26 30 31 27)
            (27 31 28 24)
            (24 25 26 27)
        );
    }
    HEATER
    {
        type wall;
        faces
        (
            (13 21 20 12)
            (14 22 21 13)
            (15 23 22 14)
            (15 12 20 23)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
